In [1]:
%reload_ext sql

In [2]:
%%sql mysql+pymysql://root:MyN3wP4ssw0rd@localhost:3306/Data_mart

SELECT 1+1;

1 rows affected.

[(2,)]

Data is without filtering

In [3]:
%%sql

SELECT * FROM   data_mart
LIMIT 5

 * mysql+pymysql://root:***@localhost:3306/Data_mart
5 rows affected.

[('ASIA', 'Retail', 'C3', 'New', 120631, 3656163, datetime.date(2020, 8, 31)),
 ('ASIA', 'Retail', 'F1', 'New', 31574, 996575, datetime.date(2020, 8, 31)),
 ('USA', 'Retail', 'null', 'Guest', 529151, 16509610, datetime.date(2020, 8, 31)),
 ('EUROPE', 'Retail', 'C1', 'New', 4517, 141942, datetime.date(2020, 8, 31)),
 ('AFRICA', 'Retail', 'C2', 'New', 58046, 1758388, datetime.date(2020, 8, 31))]

# 1. Data Cleansing Steps

## In a single query, perform the following operations and generate a new table in the data_mart schema named clean_weekly_sales:

- Convert the week_date to a DATE format

- Add a week_number as the second column for each week_date value, for example any value from the 1st of January to 7th of January will be 1, 8th to 14th will be 2 etc

- Add a month_number with the calendar month for each week_date value as the 3rd column

- Add a calendar_year column as the 4th column containing either 2018, 2019 or 2020 values

- Add a new column called age_band after the original segment column using the following mapping on the number inside the segment value

- segment	age_band

- 1	Young Adults
- 2	Middle Aged
- 3 or 4	Retirees

- Add a new demographic column using the following mapping for the first letter in the segment values:
- segment	demographic

- C	Couples
- F	Families

- Ensure all null string values with an "unknown" string value in the original segment column as well as the new age_band and demographic columns

- Generate a new avg_transaction column as the sales value divided by transactions rounded to 2 decimal places for each record

## Convert the week_date to a DATE format

In [4]:
%%sql

ALTER TABLE data_mart
  ADD COLUMN week_dates DATE;

 * mysql+pymysql://root:***@localhost:3306/Data_mart
0 rows affected.

[]

In [14]:
%%sql

UPDATE data_mart
SET    week_dates = Str_to_date(week_date, '%d/%m/%y')

 * mysql+pymysql://root:***@localhost:3306/Data_mart
17117 rows affected.

[]

In [15]:
%%sql

ALTER TABLE data_mart
  DROP COLUMN week_date;

 * mysql+pymysql://root:***@localhost:3306/Data_mart
0 rows affected.

[]

In [4]:
%%sql

SELECT *
FROM   data_mart
LIMIT  5;

 * mysql+pymysql://root:***@localhost:3306/Data_mart
5 rows affected.

[('ASIA', 'Retail', 'C3', 'New', 120631, 3656163, datetime.date(2020, 8, 31)),
 ('ASIA', 'Retail', 'F1', 'New', 31574, 996575, datetime.date(2020, 8, 31)),
 ('USA', 'Retail', 'null', 'Guest', 529151, 16509610, datetime.date(2020, 8, 31)),
 ('EUROPE', 'Retail', 'C1', 'New', 4517, 141942, datetime.date(2020, 8, 31)),
 ('AFRICA', 'Retail', 'C2', 'New', 58046, 1758388, datetime.date(2020, 8, 31))]

##  Part: A
- Add a week_number as the second column for each week_date value, for example any value from the 1st of January to 7th of January will be 1, 8th to 14th will be 2 etc

- Add a month_number with the calendar month for each week_date value as the 3rd column

- Add a calendar_year column as the 4th column containing either 2018, 2019 or 2020 values

- Note- extract(week from week_dates) without "1" it give 1-7jan as 0 and 8-14jan as 1. So i add +1 to find the required result.

In [3]:
%%sql

SELECT *,
       Extract( week FROM week_dates ) + 1 AS week_date,
       Extract(month FROM week_dates)      AS Months,
       Extract(year FROM week_dates)       AS years
FROM   data_mart
ORDER  BY week_date
LIMIT  10

 * mysql+pymysql://root:***@localhost:3306/Data_mart
10 rows affected.

[('OCEANIA', 'Retail', 'F1', 'Existing', 148503, 8483784, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('AFRICA', 'Shopify', 'null', 'New', 235, 36602, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('EUROPE', 'Retail', 'C2', 'Existing', 9433, 490857, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('AFRICA', 'Retail', 'C3', 'Existing', 218516, 12083475, datetime.date(2018, 3, 26), 13, 3, 2018),
 ('ASIA', 'Shopify', 'C2', 'New', 310, 41349, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('AFRICA', 'Retail', 'C4', 'New', 43453, 1668703, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('ASIA', 'Shopify', 'C3', 'New', 217, 30966, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('ASIA', 'Shopify', 'C1', 'Existing', 834, 128561, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('CANADA', 'Retail', 'F3', 'New', 17635, 733092, datetime.date(2020, 3, 23), 13, 3, 2020),
 ('SOUTH AMERICA', 'Shopify', 'F3', 'New', 2, 424, datetime.date(2020, 3, 23), 13, 3, 2020)]

## Add a new column called age_band after the original segment column using the following mapping on the number inside the segment value

In [4]:
%%sql

WITH sub
     AS (SELECT segment,
                Substring(segment, 2, 1) AS type
         FROM   data_mart),
     sub_2
     AS (SELECT type,
                CASE
                  WHEN type = 1 THEN "young adult"
                  WHEN type = 2 THEN "middle aged"
                  WHEN type IN ( 3, 4 ) THEN "retiree"
                  ELSE "unknown"
                END AS Age_band
         FROM   sub)
SELECT age_band,
       Count(type)
FROM   sub_2
GROUP  BY age_band
ORDER  BY Count(type)

 * mysql+pymysql://root:***@localhost:3306/Data_mart
4 rows affected.

[('unknown', 3024),
 ('Young Adult', 4032),
 ('Middle aged', 4032),
 ('Retiree', 6029)]

## Add a new demographic column using the following mapping for the first letter in the segment values:
- segment	demographic

- C	Couples
- F	Families

In [5]:
%%sql

SELECT *,
       CASE
         WHEN Substring(segment, 1, 1) = 'C' THEN 'Couples'
         WHEN Substring(segment, 1, 1) = 'F' THEN 'Families'
         ELSE 'unknown'
       end AS demographic
FROM   data_mart
LIMIT  10

 * mysql+pymysql://root:***@localhost:3306/Data_mart
10 rows affected.

[('ASIA', 'Retail', 'C3', 'New', 120631, 3656163, datetime.date(2020, 8, 31), 'Couples'),
 ('ASIA', 'Retail', 'F1', 'New', 31574, 996575, datetime.date(2020, 8, 31), 'Families'),
 ('USA', 'Retail', 'null', 'Guest', 529151, 16509610, datetime.date(2020, 8, 31), 'unknown'),
 ('EUROPE', 'Retail', 'C1', 'New', 4517, 141942, datetime.date(2020, 8, 31), 'Couples'),
 ('AFRICA', 'Retail', 'C2', 'New', 58046, 1758388, datetime.date(2020, 8, 31), 'Couples'),
 ('CANADA', 'Shopify', 'F2', 'Existing', 1336, 243878, datetime.date(2020, 8, 31), 'Families'),
 ('AFRICA', 'Shopify', 'F3', 'Existing', 2514, 519502, datetime.date(2020, 8, 31), 'Families'),
 ('ASIA', 'Shopify', 'F1', 'Existing', 2158, 371417, datetime.date(2020, 8, 31), 'Families'),
 ('AFRICA', 'Shopify', 'F2', 'New', 318, 49557, datetime.date(2020, 8, 31), 'Families'),
 ('AFRICA', 'Retail', 'C3', 'New', 111032, 3888162, datetime.date(2020, 8, 31), 'Couples')]

## Ensure all null string values with an "unknown" string value in the original segment column as well as the new age_band and demographic columns

In [6]:
%%sql

UPDATE table data_mart
SET    segment = 'unknown'
WHERE  segment = 'null'

 * mysql+pymysql://root:***@localhost:3306/Data_mart
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'table data_mart\nset segment='unknown' \nwhere segment ='null'' at line 1")
[SQL: update table data_mart
set segment='unknown'
where segment ='null']
(Background on this error at: https://sqlalche.me/e/20/f405)

In [7]:
%%sql

SELECT IF(segment = 'null', 'unknown', segment) AS segment
FROM   data_mart
LIMIT  10

 * mysql+pymysql://root:***@localhost:3306/Data_mart
10 rows affected.

[('C3',),
 ('F1',),
 ('unknown',),
 ('C1',),
 ('C2',),
 ('F2',),
 ('F3',),
 ('F1',),
 ('F2',),
 ('C3',)]

## Generate a new avg_transaction column as the sales value divided by transactions rounded to 2 decimal places for each record

In [5]:
%%sql

SELECT *,
       Round(sales / transactions, 2) AS Avg_trans
FROM   data_mart
ORDER  BY avg_trans
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/Data_mart
5 rows affected.

[('SOUTH AMERICA', 'Shopify', 'C4', 'New', 1, 0, datetime.date(2019, 4, 15), Decimal('0.00')),
 ('SOUTH AMERICA', 'Retail', 'C1', 'New', 2593, 51926, datetime.date(2020, 6, 15), Decimal('20.03')),
 ('SOUTH AMERICA', 'Retail', 'C1', 'New', 2400, 49090, datetime.date(2020, 5, 18), Decimal('20.45')),
 ('SOUTH AMERICA', 'Retail', 'C1', 'New', 2300, 47221, datetime.date(2020, 6, 8), Decimal('20.53')),
 ('SOUTH AMERICA', 'Retail', 'C1', 'New', 2450, 50578, datetime.date(2020, 4, 27), Decimal('20.64'))]

# B: Data Exploration

## B 1: What day of the week is used for each week_date value?

In [6]:
%%sql

SELECT DISTINCT( Dayname(week_dates) )
FROM   data_mart

 * mysql+pymysql://root:***@localhost:3306/Data_mart
1 rows affected.

[('Monday',)]

## B 2:  What range of week numbers are missing from the dataset?

In [15]:
%%sql

WITH sub
     AS (SELECT Generate_series(1, 52) AS week_number),
     sub_2
     AS (SELECT Week(week_dates) AS Week_no
         FROM   data_mart)
SELECT week_number
FROM   sub
       LEFT JOIN sub_2
              ON sub_2.week_no = sub.week_number
WHERE  sub.week_number IS NULL

 * mysql+pymysql://root:***@localhost:3306/Data_mart
(pymysql.err.OperationalError) (1305, 'FUNCTION data_mart.GENERATE_SERIES does not exist')
[SQL: WITH sub AS (
  SELECT GENERATE_SERIES(1,52) AS week_number
),
sub_2 as (select week(week_dates) as Week_no from data_mart )
  select week_number from sub
    left join sub_2 on sub_2.Week_no=sub.week_number
    where sub.week_number is null]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
%%sql

SELECT DISTINCT( Day(week_dates) ) AS missing_range
FROM   data_mart  limit 5;

 * mysql+pymysql://root:***@localhost:3306/Data_mart
5 rows affected.

[(31,), (24,), (17,), (10,), (3,)]

## B 3: What is the total sales for each region for each month?

In [91]:
%%sql

SELECT Year(week_dates),
       Count(transactions) AS total_transactions
FROM   data_mart
GROUP  BY 1
ORDER  BY 2

 * mysql+pymysql://root:***@localhost:3306/Data_mart
3 rows affected.

[(2018, 5698), (2019, 5708), (2020, 5711)]

## B 4: What is the total sales for each region for each month?

In [105]:
%%sql

SELECT region,
       Concat(Year(week_dates), '-', Month(week_dates)) AS dates,
       Monthname(week_dates)                            AS month_name,
       Sum(sales)                                       AS total_sales
FROM   data_mart
GROUP  BY 1,
          2,
          3
ORDER  BY 1,
          2 DESC,
          4 DESC
LIMIT  10

 * mysql+pymysql://root:***@localhost:3306/Data_mart
10 rows affected.

[('AFRICA', '2020-8', 'August', Decimal('706022238')),
 ('AFRICA', '2020-7', 'July', Decimal('574216244')),
 ('AFRICA', '2020-6', 'June', Decimal('702340026')),
 ('AFRICA', '2020-5', 'May', Decimal('570601521')),
 ('AFRICA', '2020-4', 'April', Decimal('561141452')),
 ('AFRICA', '2020-3', 'March', Decimal('295605918')),
 ('AFRICA', '2019-9', 'September', Decimal('141236454')),
 ('AFRICA', '2019-8', 'August', Decimal('564497281')),
 ('AFRICA', '2019-7', 'July', Decimal('711867600')),
 ('AFRICA', '2019-6', 'June', Decimal('546092640'))]

## B 5: What is the total count of transactions for each platform

In [109]:
%%sql

SELECT platform,
       Count(transactions) AS count_of_trans
FROM   data_mart
GROUP  BY 1
ORDER  BY 2 DESC
LIMIT  50

 * mysql+pymysql://root:***@localhost:3306/Data_mart
2 rows affected.

[('Retail', 8568), ('Shopify', 8549)]

## B 6: What is the percentage of sales for Retail vs Shopify for each month?

In [20]:
%%sql

SELECT Concat(Year(week_dates), '-', Month(week_dates)) AS dates,
       Monthname(week_dates)                            AS month_name,
       Round(Sum(CASE
                   WHEN platform = "retail" THEN sales
                   ELSE 0
                 END) * 100 / Sum(CASE
                                    WHEN platform IN ( "retail", "shopify" )
                                  THEN sales
                                    ELSE 0
                                  END), 2)              AS Retail,
       Round(Sum(CASE
                   WHEN platform = "shopify" THEN sales
                   ELSE 0
                 END) * 100 / Sum(CASE
                                    WHEN platform IN ( "retail", "shopify" )
                                  THEN sales
                                    ELSE 0
                                  END), 2)              AS Shopify
FROM   data_mart
GROUP  BY 1,
          2

 * mysql+pymysql://root:***@localhost:3306/Data_mart
20 rows affected.

[('2020-8', 'August', Decimal('96.51'), Decimal('3.49')),
 ('2020-7', 'July', Decimal('96.67'), Decimal('3.33')),
 ('2020-6', 'June', Decimal('96.80'), Decimal('3.20')),
 ('2020-5', 'May', Decimal('96.71'), Decimal('3.29')),
 ('2020-4', 'April', Decimal('96.96'), Decimal('3.04')),
 ('2020-3', 'March', Decimal('97.30'), Decimal('2.70')),
 ('2019-9', 'September', Decimal('97.09'), Decimal('2.91')),
 ('2019-8', 'August', Decimal('97.21'), Decimal('2.79')),
 ('2019-7', 'July', Decimal('97.35'), Decimal('2.65')),
 ('2019-6', 'June', Decimal('97.42'), Decimal('2.58')),
 ('2019-5', 'May', Decimal('97.52'), Decimal('2.48')),
 ('2019-4', 'April', Decimal('97.80'), Decimal('2.20')),
 ('2019-3', 'March', Decimal('97.71'), Decimal('2.29')),
 ('2018-9', 'September', Decimal('97.68'), Decimal('2.32')),
 ('2018-8', 'August', Decimal('97.71'), Decimal('2.29')),
 ('2018-7', 'July', Decimal('97.75'), Decimal('2.25')),
 ('2018-6', 'June', Decimal('97.76'), Decimal('2.24')),
 ('2018-5', 'May', Decimal('97.73'), Decimal('2.27')),
 ('2018-4', 'April', Decimal('97.93'), Decimal('2.07')),
 ('2018-3', 'March', Decimal('97.92'), Decimal('2.08'))]

## B 7: What is the percentage of sales by demographic for each year in the dataset?

In [39]:
%%sql

WITH sub
     AS (SELECT *,
                CASE
                  WHEN Substring(segment, 1, 1) = 'C' THEN 'Couples'
                  WHEN Substring(segment, 1, 1) = 'F' THEN 'Families'
                  ELSE 'unknown'
                END                                AS demographic,
                Sum(sales)
                  OVER(
                    partition BY Year(week_dates)) AS Total_sale
         FROM   data_mart)
SELECT Year(week_dates)                        AS year,
       demographic,
       Round(Sum(sales) * 100 / total_sale, 1) AS sales_percentage
FROM   sub
GROUP  BY 1,
          2,
          total_sale

 * mysql+pymysql://root:***@localhost:3306/Data_mart
9 rows affected.

[(2018, 'Families', Decimal('32.0')),
 (2018, 'Couples', Decimal('26.4')),
 (2018, 'unknown', Decimal('41.6')),
 (2019, 'Couples', Decimal('27.3')),
 (2019, 'Families', Decimal('32.5')),
 (2019, 'unknown', Decimal('40.3')),
 (2020, 'unknown', Decimal('38.6')),
 (2020, 'Families', Decimal('32.7')),
 (2020, 'Couples', Decimal('28.7'))]

## B 8: Which age_band and demographic values contribute the most to Retail sales?

In [50]:
%%sql

WITH sub AS
(
       SELECT *,
              CASE
                     WHEN Substring(segment,1,1)='C' THEN 'Couples'
                     WHEN Substring(segment,1,1)='F' THEN 'Families'
                     ELSE 'unknown'
              END AS demographic,
              CASE
                     WHEN Substring(segment,2,1)=1 THEN "Young Adult"
                     WHEN Substring(segment,2,1)=2 THEN "Middle aged"
                     WHEN Substring(segment,2,1) IN (3,4) THEN "Retiree"
                     ELSE "unknown"
              END AS age_band
       FROM   data_mart)
SELECT   age_band,
         demographic,
         Sum(sales) AS sales
FROM     sub
WHERE    platform='Retail'
GROUP BY 1,
         2 limit 1

 * mysql+pymysql://root:***@localhost:3306/Data_mart
1 rows affected.

[('Retiree', 'Couples', Decimal('6370580014'))]

## B 9: Can we use the avg_transaction column to find the average transaction size for each year for Retail vs Shopify? If not - how would you calculate it instead?

Using Avg_transaction

In [56]:
%%sql

WITH sub
     AS (SELECT *,
                Round(sales / transactions, 2) AS Avg_trans
         FROM   data_mart
         ORDER  BY avg_trans)
SELECT Year(week_dates)         AS year,
       platform,
       Round(Avg(avg_trans), 2) AS Avg_tran
FROM   sub
GROUP  BY 1,
          2

 * mysql+pymysql://root:***@localhost:3306/Data_mart
6 rows affected.

[(2020, 'Retail', Decimal('40.64')),
 (2020, 'Shopify', Decimal('174.87')),
 (2019, 'Retail', Decimal('41.97')),
 (2019, 'Shopify', Decimal('177.56')),
 (2018, 'Retail', Decimal('42.91')),
 (2018, 'Shopify', Decimal('188.28'))]

Using without transaction

In [66]:
%%sql

SELECT Year(week_dates),
       platform,
       Round(Avg(sales) / Avg(transactions), 2)
FROM   data_mart
GROUP  BY 1,
          2

 * mysql+pymysql://root:***@localhost:3306/Data_mart
6 rows affected.

[(2020, 'Retail', Decimal('36.56')),
 (2020, 'Shopify', Decimal('179.03')),
 (2019, 'Retail', Decimal('36.83')),
 (2019, 'Shopify', Decimal('183.36')),
 (2018, 'Retail', Decimal('36.56')),
 (2018, 'Shopify', Decimal('192.48'))]

# C: Before & After Analysis

## C 1: What is the total sales for the 4 weeks before and after 2020-06-15? What is the growth or reduction rate in actual values and percentage of sales?

In [96]:
%%sql

SELECT week_dates,
       "2020-06-15"                                                           AS
       Refference_date,
       Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7)                      AS
       Week_num,
       Sum(sales)                                                             AS
       Total_sales,
       ( Sum(sales) - (SELECT Sum(sales)
                       FROM   data_mart
                       WHERE  Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7)
                              = 0) )
       * 100 / (SELECT Sum(sales)
                FROM   data_mart
                WHERE  Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7) = 0) AS
       Percentage_Diff
FROM   data_mart
WHERE  Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7) <= 4
GROUP  BY 1,
          2,
          3

 * mysql+pymysql://root:***@localhost:3306/Data_mart
9 rows affected.

[(datetime.date(2020, 7, 13), '2020-06-15', 4, Decimal('585936402'), Decimal('2.7913')),
 (datetime.date(2020, 7, 6), '2020-06-15', 3, Decimal('590335394'), Decimal('3.5630')),
 (datetime.date(2020, 6, 29), '2020-06-15', 2, Decimal('575390599'), Decimal('0.9412')),
 (datetime.date(2020, 6, 22), '2020-06-15', 1, Decimal('583242828'), Decimal('2.3188')),
 (datetime.date(2020, 6, 15), '2020-06-15', 0, Decimal('570025348'), Decimal('0.0000')),
 (datetime.date(2020, 6, 8), '2020-06-15', 1, Decimal('586283390'), Decimal('2.8522')),
 (datetime.date(2020, 6, 1), '2020-06-15', 2, Decimal('585466073'), Decimal('2.7088')),
 (datetime.date(2020, 5, 25), '2020-06-15', 3, Decimal('589120804'), Decimal('3.3499')),
 (datetime.date(2020, 5, 18), '2020-06-15', 4, Decimal('585008090'), Decimal('2.6284'))]

## C 2: What about the entire 12 weeks before and after?

In [8]:
%%sql

SELECT week_dates,
       "2020-06-15"                                                           AS
       Refference_date,
       Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7)                      AS
       Week_num,
       Sum(sales)                                                             AS
       Total_sales,
       ( Sum(sales) - (SELECT Sum(sales)
                       FROM   data_mart
                       WHERE  Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7)
                              = 0) )
       * 100 / (SELECT Sum(sales)
                FROM   data_mart
                WHERE  Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7) = 0) AS
       Percentage_Diff
FROM   data_mart
WHERE  Ceil(Abs(Datediff(week_dates, "2020-06-15")) / 7) <= 12
GROUP  BY 1,
          2,
          3 limit 5;

 * mysql+pymysql://root:***@localhost:3306/Data_mart
5 rows affected.

[(datetime.date(2020, 8, 31), '2020-06-15', 11, Decimal('591603888'), Decimal('3.7855')),
 (datetime.date(2020, 8, 24), '2020-06-15', 10, Decimal('593379892'), Decimal('4.0971')),
 (datetime.date(2020, 8, 17), '2020-06-15', 9, Decimal('581075406'), Decimal('1.9385')),
 (datetime.date(2020, 8, 10), '2020-06-15', 8, Decimal('580024393'), Decimal('1.7541')),
 (datetime.date(2020, 8, 3), '2020-06-15', 7, Decimal('565709853'), Decimal('-0.7571'))]

## C 3: How do the sale metrics for these 2 periods before and after compare with the previous years in 2018 and 2019?

In [103]:
%%sql

SELECT week_dates,
       "2019-06-15"                                                           AS
       Refference_date,
       Ceil(Abs(Datediff(week_dates, "2019-06-15")) / 7)                      AS
       Week_num,
       Sum(sales)                                                             AS
       Total_sales,
       ( Sum(sales) - (SELECT Avg(sales)
                       FROM   data_mart
                       WHERE  Ceil(Abs(Datediff(week_dates, "2019-06-15")) / 7)
                              = 1) )
       * 100 / (SELECT Avg(sales)
                FROM   data_mart
                WHERE  Ceil(Abs(Datediff(week_dates, "2019-06-15")) / 7) = 1) AS
       Percentage_Diff
FROM   data_mart
WHERE  Ceil(Abs(Datediff(week_dates, "2019-06-15")) / 7) <= 4
GROUP  BY 1,
          2,
          3

 * mysql+pymysql://root:***@localhost:3306/Data_mart
8 rows affected.

[(datetime.date(2019, 7, 8), '2019-06-15', 4, Decimal('578449344'), Decimal('24431.80029384')),
 (datetime.date(2019, 7, 1), '2019-06-15', 3, Decimal('559413335'), Decimal('23624.49093128')),
 (datetime.date(2019, 6, 24), '2019-06-15', 2, Decimal('555374893'), Decimal('23453.22225638')),
 (datetime.date(2019, 6, 17), '2019-06-15', 1, Decimal('559088818'), Decimal('23610.72829793')),
 (datetime.date(2019, 6, 10), '2019-06-15', 1, Decimal('563298795'), Decimal('23789.27170207')),
 (datetime.date(2019, 6, 3), '2019-06-15', 2, Decimal('561091415'), Decimal('23695.65761833')),
 (datetime.date(2019, 5, 27), '2019-06-15', 3, Decimal('564501406'), Decimal('23840.27394313')),
 (datetime.date(2019, 5, 20), '2019-06-15', 4, Decimal('561098180'), Decimal('23695.94451921'))]